# TV Serije

Za svoj projekt sem se odločil za analizo trenutno najbolj popularnih (glede na stran imdb.com) 247 tv serij.
Zbral sem naslednje podatke o omenjenih serijah:
- naslov
- kratek opis
- žanri
- leta izida
- dolžine epizod
- število epizod
- ocena, število glasov
- igralci (in vloge)

In [91]:
import pandas as pd
%matplotlib inline

pd.options.display.max_rows = 14

Za začetek si oglejmo vse podatke, zbrane v tabelah:

In [92]:
serije = pd.read_csv('serije.csv', index_col = 'id')
zanri = pd.read_csv('zanri.csv', index_col = 'id')
drzave = pd.read_csv('drzave.csv', index_col = 'id')
igralci = pd.read_csv('igralci.csv')
leta = pd.read_csv('leta.csv')

In [93]:
serije

,naslov,opis,leto,dolzina,epizode,ocena,st_glasov
id,,,,,,,
5491994,Planet Earth II,David Attenborough returns in this breathtakin...,2016-,51,7,9.7,17184
185906,Band of Brothers,The story of Easy Company of the US Army 101st...,2001-,54,10,9.5,246659
795176,Planet Earth,"Emmy Award-winning, 11 episodes, 5 years in th...",2006-,43,11,9.5,111641
944947,Game of Thrones,Nine noble families fight for control over the...,2011-,56,73,9.5,1106304
903747,Breaking Bad,A high school chemistry teacher diagnosed with...,2008-2013,49,62,9.5,939633
306414,The Wire,"Baltimore drug scene, seen through the eyes of...",2002-2008,59,60,9.4,200345
2395695,Cosmos: A Spacetime Odyssey,A documentary series that explores how we disc...,2014-,41,13,9.3,66269
...,...,...,...,...,...,...,...
2249364,Broadchurch,The murder of a young boy in a small coastal t...,2013-,48,24,8.4,46620
54533,The Dick Van Dyke Show,The misadventures of a TV writer both at work ...,1961-1966,30,158,8.4,6395
780362,Jane Eyre,A young governess falls in love with her brood...,2006-,45,4,8.4,15611
1839578,Person of Interest,An ex-assassin and a wealthy programmer save l...,2011-2016,43,103,8.5,132854
310455,Foyle's War,"As WW2 rages around the world, DCS Foyle fight...",2002-2015,60,28,8.4,9586
6005644,TVF Tripling,"Divorced, jobless, hopeless.",2016-,30,5,8.9,6649
2126154,This Is England '88,Christmas 1988.,2011-,60,3,8.4,6268

In [94]:
zanri

                zanr
id
5491994  Documentary
185906        Action
185906         Drama
185906       History
185906           War
795176   Documentary
944947     Adventure
...              ...
310455         Crime
310455         Drama
310455       Mystery
310455           War
6005644        Drama
2126154        Crime
2126154        Drama

[774 rows x 1 columns]

In [95]:
drzave

        drzava
id
5491994     UK
185906     USA
185906      UK
795176      UK
944947     USA
944947      UK
903747     USA
...        ...
54533      USA
780362      UK
780362     USA
1839578    USA
310455      UK
6005644  India
2126154     UK

[295 rows x 1 columns]

In [96]:
igralci

           id  id igralca                     ime                       vloga
0     5491994       41003      David Attenborough         Himself - presenter
1      185906      342241            Scott Grimes          Donald G. Malarkey
2      185906      507073            Damian Lewis          Richard D. Winters
3      185906      515296          Ron Livingston                 Lewis Nixon
4      185906      853169            Shane Taylor               Eugene G. Roe
5      185906        5531         Donnie Wahlberg           C. Carwood Lipton
6      185906      950186  Peter Youngblood Hills  Darrell C. (Shifty) Powers
...       ...         ...                     ...                         ...
3384  2126154     4813425           Autumn Smiles                       Titch
3385  2126154     2772078               Ian Smith                  Mr. Benson
3386  2126154      871443          William Travis                 Mr. Squires
3387  2126154     6743500               Ryan Barr                       Trudy
3388  2126154     1276507           Alex Macqueen                   Fay's Dad
3389  2126154       40060             Emily Aston                      Janice
3390  2126154      841491            Joanna Swain                   Maitre D'

[3391 rows x 4 columns]

In [97]:
leta

           id  leto
0     5491994  2016
1      185906  2001
2      795176  2006
3      944947  2011
4      944947  2012
5      944947  2013
6      944947  2014
...       ...   ...
1833   310455  2011
1834   310455  2012
1835   310455  2013
1836   310455  2014
1837   310455  2015
1838  6005644  2016
1839  2126154  2011

[1840 rows x 2 columns]